eisup_2019_docmng_integration/src/BusinessProcesses/абсУточнениеСчетаНаОплату/абсУточнениеСчетаНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсУточнениеСчетаНаОплату</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторСогласования</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.абс_СчетНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абсСтатусыСчетов/абсСтатусыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыСчетов</name>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДРУ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДУП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДРСД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеРуководителемДФМ</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеВицеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗЗ</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>ВОплату</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОплате</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВБанк</name>
  </enumValues>
  <enumValues>
    <name>ПеренесенВГК</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>ОплаченЧастично</name>
    <comment>Оплачена часть П/П</comment>
  </enumValues>
  <enumValues>
    <name>Уточнить</name>
  </enumValues>
  <enumValues>
    <name>Уточнено</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласованиеКТТК</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеРуководителемДФМ</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеВицеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеАВЗ</name>
  </enumValues>
  <enumValues>
    <name>СчетСогласованАВЗ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/BusinessProcesses/абсУточнениеСчетаНаОплату/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры проверки условий и выборов вариантов
////////////////////////////////////////////////////////////////////////////////

Процедура УсловиеУточненоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = СчетНаОплату.СтатусСчета = Перечисления.абсСтатусыСчетов.Уточнено;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Процедуры создания групповых задач
////////////////////////////////////////////////////////////////////////////////

// Универсальня процедура формирования групповых задач
Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи)
	
	ФормируемыеЗадачи.Очистить();
	
	ЗапросИсполнителей = Новый Запрос("ВЫБРАТЬ
	                                  |	РолиИИсполнители.Исполнитель
	                                  |ИЗ
	                                  |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	                                  |ГДЕ
	                                  |	РолиИИсполнители.Роль = &РольИсполнителей");
									  
	РольИсполнителей = Неопределено;
	
	Если ТочкаМаршрута = БизнесПроцессы.абсУточнениеСчетаНаОплату.ТочкиМаршрута.ДействиеУточнено Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.СотрудникДК;
	КонецЕсли;
	
	Если РольИсполнителей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросИсполнителей.УстановитьПараметр("РольИсполнителей", РольИсполнителей);
	
	ВыборкаИсполнителей = ЗапросИсполнителей.Выполнить().Выбрать();
	
	Пока ВыборкаИсполнителей.Следующий() Цикл
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрута;
		НоваяЗадача.Дата 				= ТекущаяДата();
		НоваяЗадача.Наименование 		= Строка(СчетНаОплату) + " " + ТочкаМаршрута.НаименованиеЗадачи + ".";
		
		НоваяЗадача.Исполнитель			= ВыборкаИсполнителей.Исполнитель;
		
		НоваяЗадача.ОбъектЗадачи 		= СчетНаОплату;
		
		НоваяЗадача.Записать();
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	КонецЦикла;
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СчетНаОплату, ТочкаМаршрута, ФормируемыеЗадачи);
	
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		Отказ = Истина;
		
		Сообщить("Ошибка при формировании задач по точке " + ТочкаМаршрута + ". " + Символы.ПС 
			+ "Не найдено ответственных с ролью " + РольИсполнителей + ".");
	КонецЕсли;
	
КонецПроцедуры

// Процедуры-обработчики ПриСозданииЗадач
Процедура ДействиеУточненоПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Процедуры открытия счетов 
////////////////////////////////////////////////////////////////////////////////

// Процедура открытия счета на оплату
Процедура ОткрытьФормуСчетаНаОплату()
	
	ФормаСчета = СчетНаОплату.ПолучитьФорму("ФормаДокумента");
	
	Если ФормаСчета.Открыта() Тогда
		ФормаСчета.Активизировать();
	Иначе
		ФормаСчета.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействиеУточнениеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСчетаНаОплату();
	
КонецПроцедуры

Процедура ДействиеУточненоОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСчетаНаОплату();
	
КонецПроцедуры

Процедура ДействиеУточнениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();
	НоваяЗадача.Наименование 		= Строка(СчетНаОплату) + " " + ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= СчетНаОплату;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СчетНаОплату, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Организация = СчетНаОплату.Организация;
		
	КонецЕсли;	
	
КонецПроцедуры
